<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}


}

</style>

<b><center>
    <span style="font-size: 24pt; line-height: 1.2;">COMS W4111: Introduction to Databases</span><br>
    <span style="font-size: 24pt; line-height: 1.2;">Section 002, Spring 2023</span><br>
</center></b>
<br><br>
<i><center>
    <span style="font-size: 20pt; line-height: 1.2;">Final Exam: Practical Questions</span>
</center></i>

# Introduction and Guidance

# Submission Instructions

- Add submission instructions.

# Environment Setup and Test

## ipython-sql Magic

In [1]:
import json

In [2]:
import pandas

In [3]:
%load_ext sql

In [4]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [5]:
%sql select * from db_book.student limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

## PyMySQL

In [6]:
import pymysql

In [7]:
conn = pymysql.connect(
    host="localhost",
    user="root",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True)

In [8]:
cur = conn.cursor()
res = cur.execute("select * from db_book.student limit 10")
res = cur.fetchall()

In [9]:
res

[{'ID': '00128',
  'name': 'Zhang',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('102')},
 {'ID': '12345',
  'name': 'Shankar',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('32')},
 {'ID': '19991',
  'name': 'Brandt',
  'dept_name': 'History',
  'tot_cred': Decimal('80')},
 {'ID': '23121',
  'name': 'Chavez',
  'dept_name': 'Finance',
  'tot_cred': Decimal('110')},
 {'ID': '44553',
  'name': 'Peltier',
  'dept_name': 'Physics',
  'tot_cred': Decimal('56')},
 {'ID': '45678',
  'name': 'Levy',
  'dept_name': 'Physics',
  'tot_cred': Decimal('46')},
 {'ID': '54321',
  'name': 'Williams',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('54')},
 {'ID': '55739',
  'name': 'Sanchez',
  'dept_name': 'Music',
  'tot_cred': Decimal('38')},
 {'ID': '70557',
  'name': 'Snow',
  'dept_name': 'Physics',
  'tot_cred': Decimal('0')},
 {'ID': '76543',
  'name': 'Brown',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('58')}]

## Pandas and SQLAlchemy

In [10]:
import numpy as np

In [11]:
import sqlalchemy

In [12]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [13]:
df = pandas.read_sql("select * from db_book.student limit 10", con=engine)

In [14]:
df

      ID      name   dept_name  tot_cred
0  00128     Zhang  Comp. Sci.     102.0
1  12345   Shankar  Comp. Sci.      32.0
2  19991    Brandt     History      80.0
3  23121    Chavez     Finance     110.0
4  44553   Peltier     Physics      56.0
5  45678      Levy     Physics      46.0
6  54321  Williams  Comp. Sci.      54.0
7  55739   Sanchez       Music      38.0
8  70557      Snow     Physics       0.0
9  76543     Brown  Comp. Sci.      58.0

## MongoDB

__Note:__ The following cell only works for me. I use this approach to avoid putting passwords in publicly accessible documents,

In [15]:
import sys
import pymongo


sys.path.append(
    "/Users/ziggyxchen/Github/COMS 4111/COMS4111_002_23S/Final/s23_w4111_final_exam"
)

In [16]:
import mongo_secrets

mongo_url = mongo_secrets.mongo_atlas_url

In [17]:
# 
#
#
# You must set your Mongo Atlas URL.
#
mongo_client = pymongo.MongoClient(mongo_url)

In [18]:
list(mongo_client.list_databases())

[{'name': 'S23_GoT', 'sizeOnDisk': 405504, 'empty': False},
 {'name': 'sample_airbnb', 'sizeOnDisk': 55193600, 'empty': False},
 {'name': 'sample_analytics', 'sizeOnDisk': 9572352, 'empty': False},
 {'name': 'sample_geospatial', 'sizeOnDisk': 1413120, 'empty': False},
 {'name': 'sample_guides', 'sizeOnDisk': 40960, 'empty': False},
 {'name': 'sample_mflix', 'sizeOnDisk': 49049600, 'empty': False},
 {'name': 'sample_restaurants', 'sizeOnDisk': 6885376, 'empty': False},
 {'name': 'sample_supplies', 'sizeOnDisk': 1163264, 'empty': False},
 {'name': 'sample_training', 'sizeOnDisk': 51601408, 'empty': False},
 {'name': 'sample_weatherdata', 'sizeOnDisk': 2883584, 'empty': False},
 {'name': 'admin', 'sizeOnDisk': 348160, 'empty': False},
 {'name': 'local', 'sizeOnDisk': 26572316672, 'empty': False}]

## Neo4j

__Note:__ The following cells only work for me.

In [19]:
import neo4j_secrets

In [20]:
aura_url = neo4j_secrets.aura_url
aura_user = neo4j_secrets.aura_user
aura_pw = neo4j_secrets.aura_pw

In [21]:
import py2neo

- Uncomment and set the Aura information, then run the test.

In [22]:
from py2neo import Graph

# aura_url = 
# aura_user = 
# aura_pw = 

def t1():
    graph = Graph(aura_url, auth=(aura_user, aura_pw))
    q = "match (r:Person) where r.name='Tom Hanks' return r"
    res = graph.run(q)

    for r in res:
        print(r)

In [23]:
t1()

Node('Person', born=1956, name='Tom Hanks')

# Relational Algebra

- Just kidding.


- I think we all have had as much fun as we can stand using relational algebra and the RelaX calculator.


- You're welcome.

# Entity Relationship Modeling

## Definition to Model

- The model you will diagram has four entity types:
    1. Faculty has the properties:
        - UNI
        - last\_name
        - first\_name
        - job\_title
    2. Department has two properties:
        - department\_code
        - department\_name
    3. Student has the properties:
        - UNI
        - last\_name
        - first\_name
        - enrollment\_year
    4. Section:
        - section_id
        - semester
        - year
        - credits
        
        
- The model has the following relationships:
    1. Faculty_Department:
        - A faculty may be associated with one or more departments.
        - The association has a type: member, chair, emeritus.
    2. Student_Department:
        - A student has exactly one department that is the major_department.
        - The student may have 0 or one minor_department.
    3. Student_Section:
        - A student has a relationship to 0, 1 or many sections.
        - The student may be enrolled\_in_ the section or a ta\_for the section.
        - A section may have many enrolled students and many TAs.
    4. Faculty_Section:
        - A faculty member teaches exactly one section per semester.
        - A section has exactly one instructor per semester.
        
        
- Use Lucidchart to draw a Crow's Foot Notation ER diagram for the logical model. You may add notes to explain any reasonable assumptions you make.

<u>ER Diagram</u>

<img src="./ER.png">

## Model to Schema

- Create a new schema ```s23_final_exam```.


- Implement and execute the DDL statements to implement your ER diagram.


- The university is extremely large. So, you should define indexes that you think appropriate.

<u>SQL DDL Statements</u>

In [24]:
%%sql

DROP SCHEMA IF EXISTS s23_final_exam;
CREATE SCHEMA s23_final_exam;
USE s23_final_exam;

 * mysql+pymysql://root:***@localhost
6 rows affected.
1 rows affected.
0 rows affected.

[]

In [25]:
%%sql
DROP TABLE IF EXISTS Faculty;
CREATE TABLE Faculty(
    UNI VARCHAR(256) NOT NULL,
    last_name VARCHAR(128) NOT NULL,
    first_name VARCHAR(128) NOT NULL,
    job_title VARCHAR(256) NOT NULL,
    PRIMARY KEY(UNI)
);


# These are frequently used
CREATE INDEX Faculty_UNI ON Faculty (UNI); 
CREATE INDEX Faculty_title ON Faculty (job_title);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [26]:
%%sql
DROP TABLE IF EXISTS Department;
CREATE TABLE Department(
    department_code VARCHAR(256) NOT NULL,
    department_name VARCHAR(256) NOT NULL,
    PRIMARY KEY(department_code)
);

# These are frequently used
CREATE INDEX Department_code ON Department (department_code); 
CREATE INDEX Department_name ON Department (department_name);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [27]:
%%sql
DROP TABLE IF EXISTS Faculty_Department;
create table Faculty_Department(
    faculty_uni VARCHAR(256) NOT NULL,
    department_code VARCHAR(128) NOT NULL,
    faculty_type ENUM('member', 'chair', 'emeritus'),
    PRIMARY KEY(faculty_uni, department_code),
    FOREIGN KEY(faculty_uni) REFERENCES Faculty(UNI),
    FOREIGN KEY(department_code) REFERENCES Department(department_code)
);

# These are frequently used
CREATE INDEX Faculty_Department_primary ON Faculty_Department (faculty_uni, department_code); 
CREATE INDEX Faculty_Department_department_code ON Faculty_Department (department_code); 
CREATE INDEX Faculty_Department_faculty_type ON Faculty_Department (faculty_type);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [28]:
%%sql
DROP TABLE IF EXISTS Student;
CREATE TABLE Student(
    UNI  VARCHAR(256) NOT NULL, 
    last_name VARCHAR(128) NOT NULL,
    first_name VARCHAR(128) NOT NULL,
    enrollment_year VARCHAR(32) NOT NULL,
    major_dept_code VARCHAR(128) NOT NULL, 
    minor_dept_code VARCHAR(128) DEFAULT NULL,
    PRIMARY KEY(UNI),
    FOREIGN KEY(major_dept_code) REFERENCES Department(department_code),
    FOREIGN KEY(minor_dept_code) REFERENCES Department(department_code)
);

# These are frequently used
CREATE INDEX Student_UNI ON Student (UNI); 
CREATE INDEX Student_year ON Student (enrollment_year); 
CREATE INDEX Student_major ON Student (major_dept_code); 
CREATE INDEX Student_minor ON Student (minor_dept_code);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [29]:
%%sql
DROP TABLE IF EXISTS Section;
CREATE TABLE Section(
    section_id  VARCHAR(256) NOT NULL, 
    semester VARCHAR(64) NOT NULL,
    year VARCHAR(32) NOT NULL,
    credits VARCHAR(16) NOT NULL,
    faculty_UNI VARCHAR(256) NOT NULL, 
    PRIMARY KEY(section_ID),
    FOREIGN KEY(faculty_UNI) REFERENCES Faculty (UNI)
);

# These are frequently used
CREATE INDEX Section_id ON Section (section_id); 
CREATE INDEX Section_semester ON Section (semester); 
CREATE INDEX Section_year ON Section (year); 
CREATE INDEX Section_credits ON Section (credits);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [30]:
%%sql
DROP TABLE IF EXISTS Student_Section;
CREATE TABLE Student_Section(
    student_uni VARCHAR(256) NOT NULL, 
    section_id VARCHAR(256) NOT NULL,
    is_a_TA ENUM('Yes', 'No'), 
    PRIMARY KEY(student_uni, section_id),
    FOREIGN KEY(student_uni) REFERENCES Student (UNI),
    FOREIGN KEY(section_id) REFERENCES Section (section_id)
);

# These are frequently used
CREATE INDEX Student_Section_primary ON Student_Section (student_uni, section_id); 
CREATE INDEX Student_Section_TA ON Student_Section (is_a_TA);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

# SQL

## Customer Summary

- The following is a view that is a summary of customers and orders from Classic Models.

In [31]:
# %sql select * from s23_final.customer_order_summary limit 20;

summary = pandas.read_csv('./customer_order_summary.csv')
summary

,customerName,customerNumber,orderNumber,orderDate,shippedDate,orderTotal
0,Online Diecast Creations Co.,363,10100,2003-01-06,2003-01-10,10223.83
1,"Blauer See Auto, Co.",128,10101,2003-01-09,2003-01-11,10549.01
2,Vitachrome Inc.,181,10102,2003-01-10,2003-01-14,5494.78
3,Baane Mini Imports,121,10103,2003-01-29,2003-02-02,50218.95
4,Euro+ Shopping Channel,141,10104,2003-01-31,2003-02-01,40206.20
...,...,...,...,...,...,...
321,Mini Gifts Distributors Ltd.,124,10421,2005-05-29,NaN,7639.10
322,Diecast Classics Inc.,157,10422,2005-05-30,NaN,5849.44
323,Petit Auto,314,10423,2005-05-30,NaN,8597.73
324,Euro+ Shopping Channel,141,10424,2005-05-31,NaN,29310.30
325,La Rochelle Gifts,119,10425,2005-05-31,NaN,41623.44

- There is a CSV file in the final exam zipfile that contains the data.


- ```orderTotal``` is the sum of ```quantityOrdered*priceEach``` over all ```orderdetails``` in the order.

### Task 1

- Create a view that produces the information. Put your SQL below.

In [32]:
%sql USE classicmodels

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [33]:
%%sql

DROP VIEW IF EXISTS customer_order_summary;

CREATE VIEW customer_order_summary AS
SELECT c.customerName, 
       c.customerNumber, 
       ot.orderNumber, 
       ot.orderDate, 
       ot.shippedDate, 
       ot.orderTotal
FROM customers AS c
LEFT JOIN (
    SELECT o.customerNumber, 
           o.orderNumber, 
           o.orderDate, 
           o.shippedDate,
           COALESCE(SUM(od.quantityOrdered * od.priceEach), 0) AS orderTotal
    FROM orders AS o
    LEFT JOIN orderdetails AS od 
    ON o.orderNumber = od.orderNumber
    GROUP BY o.orderNumber
) AS ot
ON c.customerNumber = ot.customerNumber
WHERE ot.orderNumber IS NOT NULL;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

### This query demonstrates that we created a view that has the information shown in the given table. (We order by orderDate and shippedDate to match the sample data).

In [34]:
%sql SELECT * FROM customer_order_summary ORDER BY orderDate ASC, shippedDate ASC LIMIT 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('Online Diecast Creations Co.', 363, 10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 10), Decimal('10223.83')),
 ('Blauer See Auto, Co.', 128, 10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 11), Decimal('10549.01')),
 ('Vitachrome Inc.', 181, 10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 14), Decimal('5494.78')),
 ('Baane Mini Imports', 121, 10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 2), Decimal('50218.95')),
 ('Euro+ Shopping Channel', 141, 10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 1), Decimal('40206.20')),
 ('Danish Wholesale Imports', 145, 10105, datetime.date(2003, 2, 11), datetime.date(2003, 2, 12), Decimal('53959.21')),
 ('Rovelli Gifts', 278, 10106, datetime.date(2003, 2, 17), datetime.date(2003, 2, 21), Decimal('52151.81')),
 ('Land of Toys Inc.', 131, 10107, datetime.date(2003, 2, 24), datetime.date(2003, 2, 26), Decimal('22292.62')),
 ('Cruz & Sons Co.', 385, 10108, datetime.date(2003, 3, 3), datetime.date(2003, 3, 8), Decimal('51001.22')),
 ('Motor Mint Distributors Inc.', 486, 10109, datetime.date(2003, 3, 10), datetime.date(2003, 3, 11), Decimal('25833.14')),
 ('AV Stores, Co.', 187, 10110, datetime.date(2003, 3, 18), datetime.date(2003, 3, 20), Decimal('48425.69')),
 ('Volvo Model Replicas, Co', 144, 10112, datetime.date(2003, 3, 24), datetime.date(2003, 3, 29), Decimal('7674.94')),
 ('Mini Wheels Co.', 129, 10111, datetime.date(2003, 3, 25), datetime.date(2003, 3, 30), Decimal('16537.85')),
 ('Mini Gifts Distributors Ltd.', 124, 10113, datetime.date(2003, 3, 26), datetime.date(2003, 3, 27), Decimal('11044.30')),
 ("La Corne D'abondance, Co.", 172, 10114, datetime.date(2003, 4, 1), datetime.date(2003, 4, 2), Decimal('33383.14')),
 ('Classic Legends Inc.', 424, 10115, datetime.date(2003, 4, 4), datetime.date(2003, 4, 7), Decimal('21665.98')),
 ('Royale Belge', 381, 10116, datetime.date(2003, 4, 11), datetime.date(2003, 4, 13), Decimal('1627.56')),
 ('Dragon Souveniers, Ltd.', 148, 10117, datetime.date(2003, 4, 16), datetime.date(2003, 4, 17), Decimal('44380.15')),
 ('Enaco Distributors', 216, 10118, datetime.date(2003, 4, 21), datetime.date(2003, 4, 26), Decimal('3101.40')),
 ('Salzburg Collectables', 382, 10119, datetime.date(2003, 4, 28), datetime.date(2003, 5, 2), Decimal('35826.33'))]

### Task 2

- Manually logically create a materialized view ```customer_order_copy```by creating a table that is a copy of the data in the view.


- You must add some SQL to your model that automatically updates the materialized view/copy table whenever the ```orderdetails``` table has a new row inserted.


- Enter and test your DDL below.

### Create the table (MySQL does not support materialised view) and copy all data into it.

In [35]:
%%sql

DROP TABLE IF EXISTS customer_order_copy;

CREATE TABLE IF NOT EXISTS customer_order_copy (
    customerName VARCHAR(128) NOT NULL,
    customerNumber INT NOT NULL,
    orderNumber INT NOT NULL,
    orderDate DATE DEFAULT NULL,
    shippedDate DATE DEFAULT NULL,
    orderTotal DECIMAL(12,2) DEFAULT NULL,
    PRIMARY KEY (orderNumber),
    FOREIGN KEY (customerNumber) REFERENCES customers (customerNumber)
);

INSERT INTO customer_order_copy 
SELECT * FROM customer_order_summary;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
327 rows affected.

[]

### Have a look at our new table. They are the same.

In [36]:
%sql SELECT * FROM customer_order_copy LIMIT 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('Online Diecast Creations Co.', 363, 10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 10), Decimal('10223.83')),
 ('Blauer See Auto, Co.', 128, 10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 11), Decimal('10549.01')),
 ('Vitachrome Inc.', 181, 10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 14), Decimal('5494.78')),
 ('Baane Mini Imports', 121, 10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 2), Decimal('50218.95')),
 ('Euro+ Shopping Channel', 141, 10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 1), Decimal('40206.20')),
 ('Danish Wholesale Imports', 145, 10105, datetime.date(2003, 2, 11), datetime.date(2003, 2, 12), Decimal('53959.21')),
 ('Rovelli Gifts', 278, 10106, datetime.date(2003, 2, 17), datetime.date(2003, 2, 21), Decimal('52151.81')),
 ('Land of Toys Inc.', 131, 10107, datetime.date(2003, 2, 24), datetime.date(2003, 2, 26), Decimal('22292.62')),
 ('Cruz & Sons Co.', 385, 10108, datetime.date(2003, 3, 3), datetime.date(2003, 3, 8), Decimal('51001.22')),
 ('Motor Mint Distributors Inc.', 486, 10109, datetime.date(2003, 3, 10), datetime.date(2003, 3, 11), Decimal('25833.14')),
 ('AV Stores, Co.', 187, 10110, datetime.date(2003, 3, 18), datetime.date(2003, 3, 20), Decimal('48425.69')),
 ('Mini Wheels Co.', 129, 10111, datetime.date(2003, 3, 25), datetime.date(2003, 3, 30), Decimal('16537.85')),
 ('Volvo Model Replicas, Co', 144, 10112, datetime.date(2003, 3, 24), datetime.date(2003, 3, 29), Decimal('7674.94')),
 ('Mini Gifts Distributors Ltd.', 124, 10113, datetime.date(2003, 3, 26), datetime.date(2003, 3, 27), Decimal('11044.30')),
 ("La Corne D'abondance, Co.", 172, 10114, datetime.date(2003, 4, 1), datetime.date(2003, 4, 2), Decimal('33383.14')),
 ('Classic Legends Inc.', 424, 10115, datetime.date(2003, 4, 4), datetime.date(2003, 4, 7), Decimal('21665.98')),
 ('Royale Belge', 381, 10116, datetime.date(2003, 4, 11), datetime.date(2003, 4, 13), Decimal('1627.56')),
 ('Dragon Souveniers, Ltd.', 148, 10117, datetime.date(2003, 4, 16), datetime.date(2003, 4, 17), Decimal('44380.15')),
 ('Enaco Distributors', 216, 10118, datetime.date(2003, 4, 21), datetime.date(2003, 4, 26), Decimal('3101.40')),
 ('Salzburg Collectables', 382, 10119, datetime.date(2003, 4, 28), datetime.date(2003, 5, 2), Decimal('35826.33'))]

### Create a trigger to auto update the table when new rows are inserted into the orderdetails table.

In [37]:
%%sql

DROP TRIGGER IF EXISTS orderdetails_insert_trigger;

CREATE TRIGGER orderdetails_insert_trigger
    AFTER INSERT
    ON orderdetails
    FOR EACH ROW
BEGIN
    IF NEW.orderNumber NOT IN (
        SELECT orderNumber
        FROM customer_order_copy
    ) THEN
        INSERT INTO customer_order_copy
        SELECT
            customers.customerName,
            orders.customerNumber,
            orders.orderNumber,
            orders.orderDate,
            orders.shippedDate,
            NEW.quantityOrdered * NEW.priceEach AS orderTotal
        FROM
            customers
            RIGHT JOIN orders ON customers.customerNumber = orders.customerNumber
        WHERE
            orders.orderNumber = NEW.orderNumber;
    ELSE
        UPDATE customer_order_copy
        SET orderTotal = orderTotal + NEW.quantityOrdered * NEW.priceEach
        WHERE NEW.orderNumber = customer_order_copy.orderNumber;
    END IF;
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

### Test 1: when the order number is not in the table.

### 99999 is not in the database

In [38]:
%%sql

# this is to ensure that we can re-run the code with 99999 not being an existing ordernumber
DELETE FROM orderdetails WHERE orderNumber = 99999;
DELETE FROM orders WHERE orderNumber = 99999;
DELETE FROM customer_order_copy WHERE orderNumber = 99999;

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [39]:
%sql SELECT * FROM orderdetails WHERE orderNumber = 99999;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [40]:
%sql SELECT * FROM orders WHERE orderNumber = 99999;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [41]:
%%sql
SELECT * FROM customer_order_copy WHERE orderNumber = 99999;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [42]:
%%sql 
INSERT INTO orders 
(orderNumber, orderDate, requiredDate, shippedDate, status, comments, customerNumber) 
VALUES (99999, '2004-04-12', '2004-04-29', '2004-04-13', 'Shipped', NULL, 353);

INSERT INTO orderdetails 
(orderNumber, productCode, quantityOrdered, priceEach, orderLineNumber) 
VALUES
(99999, 'S18_2238', 12, 135.90, 8)

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[]

### Now we check the result (12 * 135.90 = 1630.80). It is correct.

In [43]:
%%sql
SELECT * FROM customer_order_copy WHERE orderNumber = 99999;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Reims Collectables', 353, 99999, datetime.date(2004, 4, 12), datetime.date(2004, 4, 13), Decimal('1630.80'))]

### Test 1: when the order number is in the table.

### Check before insertion

In [44]:
%sql SELECT * FROM customer_order_copy WHERE orderNumber = 10101;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Blauer See Auto, Co.', 128, 10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 11), Decimal('10549.01'))]

In [45]:
%%sql

# insert
INSERT INTO orderdetails 
(orderNumber, productCode, quantityOrdered, priceEach, orderLineNumber) 
VALUES
(10101, 'S18_2238', 12, 135.90, 8)

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

### Check after insertion (12 * 135.90 = 12179.81 - 10549.01 = 1630.80), yes it is correct.

In [46]:
%sql SELECT * FROM customer_order_copy WHERE orderNumber = 10101;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Blauer See Auto, Co.', 128, 10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 11), Decimal('12179.81'))]

In [47]:
%%sql
# this is to ensure that we can re-run the code wihtout this insertion
DELETE FROM orderdetails WHERE orderNumber = 10101 AND productCode = 'S18_2238';

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

### Task 3

- Only certain people should be able to see order details.


- Create a new user in your database ```general_user```. Configure security so that ```general_user``` can only query (read) ```customer_order_copy``` and perform no other operations.


- Put your DDL below.

### Create a user called general_user

In [48]:
%%sql

USE classicmodels;

DROP USER IF EXISTS 'general_user'@'%';

CREATE USER 'general_user'@'%' 
IDENTIFIED BY 'dbuserdbuser';

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

### Set the user connection configuration.

In [49]:
general_user_conn = pymysql.connect(
    user="general_user",
    password="dbuserdbuser",
    host="localhost",
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor
)

### Without granting permission, we cannot get the data.

In [50]:
sql = "SELECT * FROM classicmodels.customer_order_copy"

cur = general_user_conn.cursor()

try:
    res = cur.execute(sql)
    all_data = res.fetchall()
except Exception as e:
    print("Failure, excception = ", e)

Failure, excception =  (1142, "SELECT command denied to user 'general_user'@'localhost' for table 'customer_order_copy'")

### Here we grant the access.

In [51]:
%sql GRANT SELECT ON classicmodels.customer_order_copy TO 'general_user';

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

### Here we try this on more time.

In [52]:
sql = "SELECT * FROM classicmodels.customer_order_copy"

cur = general_user_conn.cursor()

all_data = None
try:
    res = cur.execute(sql)
    all_data = cur.fetchall()
    all_data_df = pandas.DataFrame(all_data)
except Exception as e:
    print("Failure, exception = ", e)

### We can now get the data.

In [53]:
all_data_df.head()

,customerName,customerNumber,orderNumber,orderDate,shippedDate,orderTotal
0,Online Diecast Creations Co.,363,10100,2003-01-06,2003-01-10,10223.83
1,"Blauer See Auto, Co.",128,10101,2003-01-09,2003-01-11,12179.81
2,Vitachrome Inc.,181,10102,2003-01-10,2003-01-14,5494.78
3,Baane Mini Imports,121,10103,2003-01-29,2003-02-02,50218.95
4,Euro+ Shopping Channel,141,10104,2003-01-31,2003-02-01,40206.20

### But it still cannot get other data, which means our implementation is correct.

In [54]:
sql = "SELECT * FROM classicmodels.customer"

cur = general_user_conn.cursor()

all_data = None
try:
    res = cur.execute(sql)
    all_data = cur.fetchall()
    all_data_df = pandas.DataFrame(all_data)
except Exception as e:
    print("Failure, exception = ", e)

Failure, exception =  (1142, "SELECT command denied to user 'general_user'@'localhost' for table 'customer'")

## Identifying Traitors

- You use the Lahman's Baseball Database for this problem.


- You need the ```People``` table and the ```Appearances``` table.


- A perfidious, modern day traitor is:
    - A player who appeared/played for the Red Sox before ever playing for the Yankees.
    - Subsequently (later) appeared/played for the Yankees.
    - Played/appeared in their first game for any team after the year 2000.
    
    
- Write a query that produces the perfidious, modern day traitors. Your table should have the following columns:
    - ```playerID```
    - ```nameFirst```
    - ```nameLast```
    - ```firstRedSoxGameYear``` is the year of the first appearance for the Red Sox.
    - ```firstYankeeGameYear``` is the year of the first appearance for the Yankees.
    
    
- Order the result by ```nameLast, nameFirst```.


- The ```teamID```  for the Yankees is ```NYA``` and the ```teamID``` for the Red Sox is ```BOS```.


- Put your SQL below.

In [55]:
%sql USE lahmanshw1;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [56]:
%%sql

WITH
  first_bos_year AS (
    SELECT playerID, MIN(yearID) AS BOS_year
    FROM Appearances
    WHERE teamID = 'BOS'
    GROUP BY playerID
  ),
  first_nya_year AS (
    SELECT playerID, MIN(yearID) AS NYA_year
    FROM Appearances
    WHERE teamID = 'NYA'
    GROUP BY playerID
  ),
  traitor_players AS (
    SELECT cte1.playerID, cte1.BOS_year, cte2.NYA_year
    FROM first_bos_year cte1
    JOIN first_nya_year cte2 USING(playerID)
    WHERE cte1.BOS_year < cte2.NYA_year
  )
SELECT DISTINCT
  People.playerID,
  People.nameFirst,
  People.nameLast,
  traitor_players.BOS_year AS firstRedSoxGameYear,
  traitor_players.NYA_year AS firstYankeeGameYear
FROM
  People
  JOIN traitor_players USING(playerID)
WHERE
  People.debut >= '2000-01-01'
ORDER BY
  People.nameLast,
  People.nameFirst

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('aardsda01', 'David', 'Aardsma', '2008', '2012'),
 ('bailean01', 'Andrew', 'Bailey', '2012', '2015'),
 ('cashke01', 'Kevin', 'Cash', '2007', '2009'),
 ('drewst01', 'Stephen', 'Drew', '2013', '2014'),
 ('ellsbja01', 'Jacoby', 'Ellsbury', '2007', '2014'),
 ('hillri01', 'Rich', 'Hill', '2010', '2014'),
 ('hinsker01', 'Eric', 'Hinske', '2006', '2009'),
 ('lamarry01', 'Ryan', 'LaMarre', '2016', '2021'),
 ('layneto01', 'Tommy', 'Layne', '2014', '2016'),
 ('lillibr01', 'Brent', 'Lillibridge', '2012', '2013'),
 ('mcdonda02', 'Darnell', 'McDonald', '2010', '2012'),
 ('millean01', 'Andrew', 'Miller', '2011', '2015'),
 ('molingu01', 'Gustavo', 'Molina', '2010', '2011'),
 ('thornma01', 'Matt', 'Thornton', '2013', '2014'),
 ('youklke01', 'Kevin', 'Youkilis', '2004', '2013')]

# MongoDB

- Use the ```episodes``` collection you have previously loaded into MongoDB Atlas.


- An episode has an array ```openingSequenceLocations```.


- Write an aggregation that produces a Pandas data frame of the form:
    - ```openingSequenceLocation```
    - ```numberOfEpisodes``` is the number of episodes that have the location in the opening sequence.
    - ```firstAirDate``` is the air date of the first episode in which the location appears in the opening.
    - ```lastAirDate``` is the air date of the last episode in which the location appears.
    
    
- The zipfile for the final exam contains a CSV file with the result of the aggregation. You must sort your result by ```numOfEpisodes.```


- The data is the following. __Do not worry about the leading index column.__

In [57]:
opening_sequences_df = pandas.read_csv("opening_sequence_info.csv")

In [58]:
opening_sequences_df

          location  numOfEpisodes firstAirDate lastAirDate
0       Winterfell             73      4/17/11     5/19/19
1   King's Landing             73      4/17/11     5/19/19
2         The Wall             67      4/17/11     8/27/17
3          Meereen             30       4/6/14     6/26/16
4          Braavos             21      5/11/14     6/19/16
5      Dragonstone             19       4/1/12     8/27/17
6        Harrenhal             15      4/22/12     5/19/13
7             Pyke             15       4/8/12      8/6/17
8     Vaes Dothrak             15      4/24/11     5/29/16
9            Dorne              9       5/3/15     6/26/16
10        Riverrun              9      4/14/13     6/19/16
11       Dreadfort              7       4/6/14     5/18/14
12         Oldtown              7      7/16/17     8/27/17
13       The Eyrie              7      5/15/11     5/15/16
14           Qarth              7      4/22/12      6/3/12
15     Last Hearth              6      4/14/19     5/19/19
16          Yunkai              6      4/28/13      6/9/13
17       The Twins              5      6/12/11     7/16/17
18     Moat Cailin              4       6/1/14     4/26/15
19         Astapor              4      3/31/13     4/21/13
20       Eastwatch              3      8/13/17     8/27/17
21          Pentos              2      4/17/11     3/29/15

- Write an execute your aggregation below.

### The results are consistent with the sample answer

In [59]:
expression = [
    {"$unwind": "$openingSequenceLocations"},
    {"$group": {
        "_id": {"location": "$openingSequenceLocations"},
        "numberOfEpisodes": {"$sum": 1},
        "firstAirDate": {"$min": "$episodeAirDate"},
        "lastAirDate": {"$max": "$episodeAirDate"},
    }},
    {"$addFields": {
        "location": "$_id.location",
        "firstAirDate": {
            "$dateToString": {
                "format": "%m/%d/%Y",
                "date": {"$dateFromString": {"dateString": "$firstAirDate"}},
            },
        },
        "lastAirDate": {
            "$dateToString": {
                "format": "%m/%d/%Y",
                "date": {"$dateFromString": {"dateString": "$lastAirDate"}},
            },
        },
    }},
    {"$project": {
        "_id": 0,
        "location": 1,
        "numberOfEpisodes": 1,
        "firstAirDate": 1,
        "lastAirDate": 1,
    }},
    {"$sort": {
        "numberOfEpisodes": -1
    }},
]

result = mongo_client["S23_GoT"]["Episodes"].aggregate(expression)
result = list(result)
result_df = pandas.DataFrame(result)
# re-order the columns so that we can have a better see the results
result_df = result_df[['location', 'numberOfEpisodes', 'firstAirDate', 'lastAirDate']]
result_df

          location  numberOfEpisodes firstAirDate lastAirDate
0   King's Landing                73   04/17/2011  05/19/2019
1       Winterfell                73   04/17/2011  05/19/2019
2         The Wall                67   04/17/2011  08/27/2017
3          Meereen                30   04/06/2014  06/26/2016
4          Braavos                21   05/11/2014  06/19/2016
5      Dragonstone                19   04/01/2012  08/27/2017
6             Pyke                15   04/08/2012  08/06/2017
7     Vaes Dothrak                15   04/24/2011  05/29/2016
8        Harrenhal                15   04/22/2012  05/19/2013
9            Dorne                 9   05/03/2015  06/26/2016
10        Riverrun                 9   04/14/2013  06/19/2016
11         Oldtown                 7   07/16/2017  08/27/2017
12       Dreadfort                 7   04/06/2014  05/18/2014
13           Qarth                 7   04/22/2012  06/03/2012
14       The Eyrie                 7   05/15/2011  05/15/2016
15          Yunkai                 6   04/28/2013  06/09/2013
16     Last Hearth                 6   04/14/2019  05/19/2019
17       The Twins                 5   06/12/2011  07/16/2017
18     Moat Cailin                 4   06/01/2014  04/26/2015
19         Astapor                 4   03/31/2013  04/21/2013
20       Eastwatch                 3   08/13/2017  08/27/2017
21          Pentos                 2   04/17/2011  03/29/2015

# Neo4j

- Use the sample movie data for these questions.

- Write a Cyper query that returns a table with the following information:
    - director
    - movie_title
    - actor
    - movie_released_year
    
    
- The zipfile for the final exam contains a CSV file with a sample result. __Do not worry about the leading index column.__

In [60]:
neo4j_result = pandas.read_csv('neo4j_result.csv')
neo4j_result

           director     movie_title            actor  movie_release_year
0    Lana Wachowski     Speed Racer     Emile Hirsch                2008
1    Lana Wachowski     Speed Racer             Rain                2008
2    Lana Wachowski     Speed Racer  Christina Ricci                2008
3    Lana Wachowski     Speed Racer        Ben Miles                2008
4    Lana Wachowski     Speed Racer   Susan Sarandon                2008
5    Lana Wachowski     Speed Racer     John Goodman                2008
6    Lana Wachowski     Speed Racer      Matthew Fox                2008
7   Lilly Wachowski     Speed Racer     Emile Hirsch                2008
8   Lilly Wachowski     Speed Racer             Rain                2008
9   Lilly Wachowski     Speed Racer  Christina Ricci                2008
10  Lilly Wachowski     Speed Racer        Ben Miles                2008
11  Lilly Wachowski     Speed Racer   Susan Sarandon                2008
12  Lilly Wachowski     Speed Racer     John Goodman                2008
13  Lilly Wachowski     Speed Racer      Matthew Fox                2008
14       Ron Howard     Frost/Nixon     Sam Rockwell                2008
15       Ron Howard     Frost/Nixon    Michael Sheen                2008
16       Ron Howard     Frost/Nixon   Frank Langella                2008
17       Ron Howard     Frost/Nixon     Oliver Platt                2008
18       Ron Howard     Frost/Nixon      Kevin Bacon                2008
19   James Marshall  Ninja Assassin             Rain                2009
20   James Marshall  Ninja Assassin        Ben Miles                2009
21   James Marshall  Ninja Assassin        Rick Yune                2009
22   James Marshall  Ninja Assassin    Naomie Harris                2009
23       Tom Tykwer     Cloud Atlas        Tom Hanks                2012
24       Tom Tykwer     Cloud Atlas    Jim Broadbent                2012
25       Tom Tykwer     Cloud Atlas      Halle Berry                2012
26       Tom Tykwer     Cloud Atlas     Hugo Weaving                2012
27   Lana Wachowski     Cloud Atlas        Tom Hanks                2012
28   Lana Wachowski     Cloud Atlas    Jim Broadbent                2012
29   Lana Wachowski     Cloud Atlas      Halle Berry                2012
30   Lana Wachowski     Cloud Atlas     Hugo Weaving                2012
31  Lilly Wachowski     Cloud Atlas        Tom Hanks                2012
32  Lilly Wachowski     Cloud Atlas    Jim Broadbent                2012
33  Lilly Wachowski     Cloud Atlas      Halle Berry                2012
34  Lilly Wachowski     Cloud Atlas     Hugo Weaving                2012

- Execute your Neo4j query below.

In [61]:
graph = Graph(aura_url, auth=(aura_user, aura_pw))
q = """
MATCH (director)-[:DIRECTED]->(r:Movie)<-[:ACTED_IN]-(actor)
RETURN director.name as director, r.title as movie_title, actor.name as actor, r.released as movie_release_year
"""
res = graph.run(q)

df = pandas.DataFrame.from_records(res, columns=['director', 'movie_title', 'actor', 'movie_release_year'])
df

,director,movie_title,actor,movie_release_year
0,Lana Wachowski,The Matrix,Emil Eifrem,1999
1,Lana Wachowski,The Matrix,Hugo Weaving,1999
2,Lana Wachowski,The Matrix,Laurence Fishburne,1999
3,Lana Wachowski,The Matrix,Carrie-Anne Moss,1999
4,Lana Wachowski,The Matrix,Keanu Reeves,1999
...,...,...,...,...
195,Penny Marshall,A League of Their Own,Madonna,1992
196,Penny Marshall,A League of Their Own,Rosie O'Donnell,1992
197,Penny Marshall,A League of Their Own,Geena Davis,1992
198,Penny Marshall,A League of Their Own,Bill Paxton,1992
199,Penny Marshall,A League of Their Own,Lori Petty,1992

### Here we filter and sort the df to see if our results match the sample answer. And our answer is correct

In [62]:
filtered_df = df.query('2008 <= movie_release_year <= 2012').sort_values(by=['movie_release_year', 'director'], ascending=True)
filtered_df

            director     movie_title            actor  movie_release_year
137   Lana Wachowski     Speed Racer     Emile Hirsch                2008
138   Lana Wachowski     Speed Racer             Rain                2008
139   Lana Wachowski     Speed Racer  Christina Ricci                2008
140   Lana Wachowski     Speed Racer        Ben Miles                2008
141   Lana Wachowski     Speed Racer   Susan Sarandon                2008
142   Lana Wachowski     Speed Racer     John Goodman                2008
143   Lana Wachowski     Speed Racer      Matthew Fox                2008
144  Lilly Wachowski     Speed Racer     Emile Hirsch                2008
145  Lilly Wachowski     Speed Racer             Rain                2008
146  Lilly Wachowski     Speed Racer  Christina Ricci                2008
147  Lilly Wachowski     Speed Racer        Ben Miles                2008
148  Lilly Wachowski     Speed Racer   Susan Sarandon                2008
149  Lilly Wachowski     Speed Racer     John Goodman                2008
150  Lilly Wachowski     Speed Racer      Matthew Fox                2008
163       Ron Howard     Frost/Nixon     Sam Rockwell                2008
164       Ron Howard     Frost/Nixon    Michael Sheen                2008
165       Ron Howard     Frost/Nixon   Frank Langella                2008
166       Ron Howard     Frost/Nixon     Oliver Platt                2008
167       Ron Howard     Frost/Nixon      Kevin Bacon                2008
151   James Marshall  Ninja Assassin             Rain                2009
152   James Marshall  Ninja Assassin        Ben Miles                2009
153   James Marshall  Ninja Assassin        Rick Yune                2009
154   James Marshall  Ninja Assassin    Naomie Harris                2009
120   Lana Wachowski     Cloud Atlas        Tom Hanks                2012
121   Lana Wachowski     Cloud Atlas    Jim Broadbent                2012
122   Lana Wachowski     Cloud Atlas      Halle Berry                2012
123   Lana Wachowski     Cloud Atlas     Hugo Weaving                2012
124  Lilly Wachowski     Cloud Atlas        Tom Hanks                2012
125  Lilly Wachowski     Cloud Atlas    Jim Broadbent                2012
126  Lilly Wachowski     Cloud Atlas      Halle Berry                2012
127  Lilly Wachowski     Cloud Atlas     Hugo Weaving                2012
116       Tom Tykwer     Cloud Atlas        Tom Hanks                2012
117       Tom Tykwer     Cloud Atlas    Jim Broadbent                2012
118       Tom Tykwer     Cloud Atlas      Halle Berry                2012
119       Tom Tykwer     Cloud Atlas     Hugo Weaving                2012